Revit 2027 API
SiteLocation.ConvertToProjectTime Method
Converts local time or UTC time to project time.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public DateTime ConvertToProjectTime(
	DateTime inputTime
)
Public Function ConvertToProjectTime (
	inputTime As DateTime
) As DateTime
public:
DateTime ConvertToProjectTime(
	DateTime inputTime
)
member ConvertToProjectTime :
        inputTime : DateTime -> DateTime
Parameters
inputTime DateTime
The input local time or UTC time.
Return Value
DateTime
Exceptions
Exception | Condition
ArgumentException |  Thrown when the inputTime's kind is neither Local nor Utc.
Remarks
Daylight savings time is not considered during this conversion.
See Also
Reference
SiteLocation Class
Autodesk.Revit.DB Namespace